examples/openfoam/DH1_run/0/boundary
FoamFile
{
    version     2.0;
    format      ascii;
    class	file;
    object	boundary;
}
    top
    {
        type    symmetryPlane;
    }

    bottom
    {
        type	symmetryPlane;
    }
    
    front
    {
        type    cyclic;
    }

    back
    {
        type	cyclic;
    }



