examples/openfoam/DH1_run/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0022;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0022;
    }

    outlet
    {
        type            zeroGradient;
    }

    obstacle
    {
        type            kqRWallFunction;
        value           uniform 0.0001;
    }

#include "boundary"

}


// ************************************************************************* //
