examples/openfoam/DH1_run/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0808;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0808;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    obstacle
    {
        type            omegaWallFunction;
        value           uniform 0.0001;
    }

#include "boundary"

}


// ************************************************************************* //
